package org.quickjava.orm.enums;

/*
 * Copyright (c) 2020~2023 http://www.quickjava.org All rights reserved.
 * +-------------------------------------------------------------------
 * Organization: QuickJava
 * +-------------------------------------------------------------------
 * Author: Qlo1062
 * +-------------------------------------------------------------------
 * File: ModelFieldFill
 * +-------------------------------------------------------------------
 * Date: 2023-5-26 10:11
 * +-------------------------------------------------------------------
 * License: Apache Licence 2.0
 * +-------------------------------------------------------------------
 */
public enum ModelFieldFill {
    NULL,
    /**
     * 当前日期时间
     */
    DATETIME,
    DATE,
    TIME,
    /**
     * 当前秒级时间戳
     */
    TIMESTAMP,
    /**
     * 当前毫秒级时间戳
     */
    MILL_TIMESTAMP,
    /**
     * 自定义方法回调
     */
    STATIC_METHOD,
    ;

}
